src/cf/Documents/ЗаписиУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписиУСН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПримененныеВычетыПоНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаписей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаписейФормированийКУДиР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаписиКУДиР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаписиУСН</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеЗатрат</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
								<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВзносыПодлежащиеУплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзносаПодлежащегоУплате</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыФиксированныхВзносовПодлежащихУплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПоОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПризнания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнеоборотныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаписиУСН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.ЗаписиУСН
//  ДополнительныеСвойства - Структура 
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ДанныеПроведения = ДополнительныеСвойства.ДляПроведения;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ЗаписиУСНЗаписиКУДиР.ДоходВсего КАК ДоходВсего,
	|	ЗаписиУСНЗаписиКУДиР.ДоходБаза КАК ДоходБаза,
	|	ЗаписиУСНЗаписиКУДиР.РасходВсего КАК РасходВсего,
	|	ЗаписиУСНЗаписиКУДиР.РасходБаза КАК РасходБаза,
	|	ЗаписиУСНЗаписиКУДиР.НДС КАК НДС,
	|	ЗаписиУСНЗаписиКУДиР.Содержание КАК Содержание,
	|	ЗаписиУСНЗаписиКУДиР.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ЗаписиУСНЗаписиКУДиР.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ЗаписиУСНЗаписиКУДиР.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ЗаписиУСНЗаписиКУДиР.Ссылка.ВидЗаписей КАК ВидЗаписи,
	|	ЗаписиУСНЗаписиКУДиР.НомерСтроки КАК НомерСтрокиДокумента,
	|	ЗаписиУСНЗаписиКУДиР.ВзносыПодлежащиеУплате КАК ВзносыПодлежащиеУплате,
	|	ЗаписиУСНЗаписиКУДиР.ВидВзносаПодлежащегоУплате КАК ВидВзносаПодлежащегоУплате
	|ИЗ
	|	Документ.ЗаписиУСН.ЗаписиКУДиР КАК ЗаписиУСНЗаписиКУДиР
	|ГДЕ
	|	ЗаписиУСНЗаписиКУДиР.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиУСНГрафикПоОС.ПериодПризнания КАК Период,
	|	&Организация КАК Организация,
	|	ЗаписиУСНГрафикПоОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ЗаписиУСНГрафикПоОС.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаписиУСН.ГрафикПоОС КАК ЗаписиУСНГрафикПоОС
	|ГДЕ
	|	ЗаписиУСНГрафикПоОС.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеПроведения.Ссылка);
	Запрос.УстановитьПараметр("Период", ДанныеПроведения.Дата);
	Запрос.УстановитьПараметр("Организация", ДанныеПроведения.ОрганизацияДляРегОтчетности);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаКнигаУчетаДоходовИРасходов", Результат[0].Выгрузить());
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГрафикПризнанияРасходовНаОСиНМА",
		Результат[1].Выгрузить());
	
КонецПроцедуры

// Возвращает текстовое представление документа в виде
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ЗаписиУСН
//  
// Возвращаемое значение: 
//  - Строка - представление документа
//
Функция ОписаниеДокумента(ДокументСсылка) Экспорт
	
	ОписаниеДокумента = Новый Структура("Наименование");
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		РеквизитыДокумента    = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
			"Номер, Дата, Ссылка");
		
		НаименованиеДокумента = ДокументСсылка.Метаданные().Синоним;
		НомерДокумента        = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.Номер, Истина, Истина);
		ДатаДокумента         = Формат(РеквизитыДокумента.Дата,"ДЛФ=D");
		Статус                = ИнтерфейсыВзаимодействияБРО.ПредставлениеСостоянияДокумента(РеквизитыДокумента.Ссылка);
		
		ШаблонПредставления = НСтр("ru = '%1 %2 от %3 (%4)'");
		
		ОписаниеДокумента.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления,
			НаименованиеДокумента, НомерДокумента, ДатаДокумента, Статус);
	КонецЕсли;
	
	Возврат ОписаниеДокумента;
	
КонецФункции

// Возвращает список месяцев, в течение которых из доходов и/или расходов для КУДиР нужно исключать сумму НДС
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  ДатаНачала - Дата
//  ДатаОкончания - Дата
//  
// Возвращаемое значение: 
//  - Структура:
//     * МесяцыДоходыБезНДС - Массив из Дата
//     * МесяцыРасходыБезНДС - Массив из Дата
//
Функция МесяцыИсключенияНДСИзДоходовРасходов(Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("МесяцыДоходыБезНДС", Новый Массив);
	Результат.Вставить("МесяцыРасходыБезНДС", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РегламентированнаяОтчетностьУСН.ПолучитьВТПериодыСтавокНДСНаУСН(Запрос.МенеджерВременныхТаблиц, Организация,
		ДатаНачала, ДатаОкончания);
		
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТПериодыСтавокНДСНаУСН.ПериодНачало КАК ПериодНачало,
	|	ВТПериодыСтавокНДСНаУСН.ПериодОкончание КАК ПериодОкончание,
	|	ВТПериодыСтавокНДСНаУСН.НДСИсключитьДоходы КАК НДСИсключитьДоходы,
	|	ВТПериодыСтавокНДСНаУСН.НДСИсключитьРасходы КАК НДСИсключитьРасходы
	|ИЗ
	|	ВТПериодыСтавокНДСНаУСН КАК ВТПериодыСтавокНДСНаУСН";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Месяц = НачалоМесяца(Выборка.ПериодНачало);
		Пока Месяц < Выборка.ПериодОкончание Цикл
			
			Если Выборка.НДСИсключитьДоходы Тогда
				Результат.МесяцыДоходыБезНДС.Добавить(Месяц);
			КонецЕсли;
			
			Если Выборка.НДСИсключитьРасходы Тогда
				Результат.МесяцыРасходыБезНДС.Добавить(Месяц);
			КонецЕсли;
			
			Месяц = ДобавитьМесяц(Месяц, 1);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
